#### Combine two tables in pandas

In [1]:
import pandas as pd

In [2]:
data = [[1, 'Wang', 'Allen'], [2, 'Alice', 'Bob']]
person = pd.DataFrame(data, columns=['personId', 'firstName', 'lastName']).astype({'personId':'Int64', 'firstName':'object', 'lastName':'object'})
data = [[1, 2, 'New York City', 'New York'], [2, 3, 'Leetcode', 'California']]
address = pd.DataFrame(data, columns=['addressId', 'personId', 'city', 'state']).astype({'addressId':'Int64', 'personId':'Int64', 'city':'object', 'state':'object'})

In [3]:
data

[[1, 2, 'New York City', 'New York'], [2, 3, 'Leetcode', 'California']]

In [4]:
address

   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

In [5]:
person

   personId firstName lastName
0         1      Wang    Allen
1         2     Alice      Bob

In [9]:
df = pd.merge(left=person,right=address,on='personId',how='left')
df[['firstName','lastName','city','state']]

  firstName lastName           city     state
0      Wang    Allen            NaN       NaN
1     Alice      Bob  New York City  New York

In [10]:
data = [[1, 'Joe', 70000, 3], [2, 'Henry', 80000, 4], [3, 'Sam', 60000, None], [4, 'Max', 90000, None]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'managerId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'managerId':'Int64'})

In [31]:
employee

   id   name  salary  managerId
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000       <NA>
3   4    Max   90000       <NA>

In [42]:
df = pd.merge(employee,employee,left_on='managerId',right_on='id')
df[df['salary_x']>df['salary_y']][['name_x']].rename(columns={'name_x':'Employee'})

  Employee
0      Joe

In [40]:
df

   id_x name_x  salary_x  managerId_x  id_y name_y  salary_y  managerId_y
0     1    Joe     70000            3     3    Sam     60000         <NA>
1     2  Henry     80000            4     4    Max     90000         <NA>

In [50]:
data = [[1, 'a@b.com'], [2, 'c@d.com'], [3, 'a@b.com'],[4,'a@b.com']]
person = pd.DataFrame(data, columns=['id', 'email']).astype({'id':'Int64', 'email':'object'})

In [51]:
person

   id    email
0   1  a@b.com
1   2  c@d.com
2   3  a@b.com
3   4  a@b.com

In [62]:
person.groupby('email',as_index=False).nunique().rename(columns={'id':'count'})

     email  count
0  a@b.com      3
1  c@d.com      1